package com.wbdp.wx.exception;

import java.util.HashMap;
import java.util.Map;

import org.apache.log4j.Logger;
import org.springframework.stereotype.Component;

/**
 * 微信接口调用返回码异常类
 * @author wisedata005
 */
public class WeiChatExcption extends Exception {


	/***/
    private Logger log = Logger.getLogger(WeiChatExcption.class);
	/**返回码*/
	private int code;
	/**返回码数*/
	private int backcode[] = { -1, 0, 4001, 40002,40003,40004,40005,40006,40007,40008,
			40009,40010,40011,40012,40013,40014,40015,40016,40017,40018,40019,40020,
			40021,40022,40023,40024,40025,40026,40027,40028,40029,40030,40031,40032,
			40033,40035,40038,40039,40050,40051,40117,40118,40119,40120,40121,40132,
			40137,40155,41001,41002,41003,41004,41005,41006,41007,41008,41009,42001,
			42002,42003,42007,43001,43002,43003,43004,43005,43019,44001,44002,44003,
			44004,45001,45002,45003,45004,45005,45006,45007,45008,45009,45010,45011,
			45015,45016,45017,45018,45047,46001,46002,46003,46004,47001,48001,48002,
			48004,48005,48006,50001,50002,61451,61452,61453,61454,61455,61456,61457,
			61450,61500,65301,65302,65303,65304,65305,65306,65307,65308,65309,65310,
			65311,65312,65313,65314,65316,65317,9001001,9001002,9001003,9001004,9001005,
			9001006,9001007,9001008,9001009,9001010,9001020,9001021,9001022,9001023,
			9001024,9001025,9001026,9001027,9001028,9001029,9001030,9001031,9001032,
			9001033,9001034,9001035,9001036};

	/**返回码说明数*/
	private String explain[] = {
			"系统繁忙，此时请开发者稍候再试","请求成功",
			"获取access_token时AppSecret错误，或者access_token无效。" +
			"请开发者认真比对AppSecret的正确性，或查看是否正在为恰当的公众号调用接口", "不合法的凭证类型"
		  ,"不合法的OpenID，请开发者确认OpenID（该用户）是否已关注公众号，或是否是其他公众号的OpenID",
		  "不合法的媒体文件类型","不合法的文件类型","不合法的文件大小","不合法的媒体文件id","不合法的消息类型",
		  "不合法的图片文件大小","不合法的语音文件大小","不合法的视频文件大小","不合法的缩略图文件大小",
		  "不合法的AppID，请开发者检查AppID的正确性，避免异常字符，注意大小写",
		  "不合法的access_token，请开发者认真比对access_token的有效性（如是否过期），或查看是否正在为恰当的公众号调用接口",
		  "不合法的菜单类型","不合法的按钮个数","不合法的按钮个数","不合法的按钮名字长度","不合法的按钮KEY长度",
		  "不合法的按钮URL长度","不合法的菜单版本号","不合法的子菜单级数","不合法的子菜单按钮个数","不合法的子菜单按钮类型",
		  "不合法的子菜单按钮名字长度","不合法的子菜单按钮KEY长度","不合法的子菜单按钮URL长度","不合法的自定义菜单使用用户",
		  "不合法的oauth_code","不合法的refresh_token","不合法的openid列表","不合法的openid列表长度",
		  "不合法的请求字符，不能包含\\uxxxx格式的字符","不合法的参数","不合法的请求格式","不合法的URL长度",
		  "不合法的分组id","分组名字不合法","分组名字不合法","media_id大小不合法","button类型错误","button类型错误",
		  "不合法的media_id类型","微信号不合法","不支持的图片格式","请勿添加其他公众号的主页链接","缺少access_token参数",
		  "缺少appid参数","缺少refresh_token参数","缺少secret参数","缺少多媒体文件数据","缺少media_id参数",
		  "缺少子菜单数据","缺少oauth code","缺少openid",
		  "access_token超时，请检查access_token的有效期，请参考基础支持-获取access_token中，对access_token的详细机制说说明",
		  "refresh_token超时","oauth_code超时","用户修改微信密码，accesstoken和refreshtoken失效，需要重新授权",
		  "需要GET请求","需要POST请求","需要HTTPS请求","需要接收者关关注","需要好友关系","需要将接收者从黑名单中移除",
		  "多媒体文件为空","POST的数据包为空","图文消息内容为空","文本消息内容为空","多媒体文件大小超过限制","消息内容超过限制",
		  "标题字段超过限制","描述字段超过限制","链接字段超过限制","图片链接字段超过限制","语音播放时间超过限制","图文消息超过限制",
		  "接口调用超过限制","创建菜单个数超过限制","API调用太频繁，请稍候再试","回复时间超过限制","系统分组，不允许修改",
		  "分组名字过长","分组数量超过上限","客服接口下行条数超过上限","不存在媒体数据","不存在的菜单版本","不存在的菜单数据",
		  "不存在的用户","解析JSON/XML内容错误","api功能未授权，请确认公众号已获得该接口，可以在公众平台官网-需要者中心页中查看接口权限",
		  "粉丝拒收消息（粉丝在公众号选项中，关闭了“接收消息”）","api接口被封禁，请登录mp.weixin.qq.com查看详情",
		  "api禁止删除被自动回复和自定义菜单引用的素材","api禁止清零调用次数，因为清零次数达到上限","用户未授权该api",
		  "用户受限，可能是违规后接口被封禁","参数错误(invalid parameter)","无效客服账号(invalid kf_account)",
		  "客服帐号已存在(kf_account exsited)",
		  "客服帐号名长度超过限制(仅允许10个英文字符，不包括@及@后的公众号的微信号)(invalid   kf_acount length)",
		  "客服帐号名包含非法字符(仅允许英文+数字)(illegal character in     kf_account)",
		  "客服帐号个数超过限制(10个客服账号)(kf_account count exceeded)","无效头像文件类型(invalid   file type)",
		  "系统错误(system error)","日期格式错误","不存在此menuid对应的个性化菜单","没有相应的用户","没有默认菜单，不能创建个性化菜单",
		  "MatchRule信息为空","个性化菜单数量受限","不支持个性化菜单的帐号","个性化菜单信息为空","包含没有响应类型的button",
		  "个性化菜单开关处于关闭状态","写了省份或城市信息，国家信息不能为空","填写了城市信息，省份信息不能为空","不合法的国家信息",
		  "不合法的省份信息","不合法的城市信息","该公众号的菜单设置了过多的域名外跳（最多跳转到3个域名的链接）","不合法的URL",
		  "POST数据参数不合法","远端服务不可用","Ticket不合法","获取摇周边用户信息失失败","获取商户信息失败","获取OpenID失败",
		  "上传文件缺失","上传素材的文件类型不合法","上传素材的文件尺寸不合法","上传失败","帐号不合法",
		  "已有设备激活率低于50%，不能新增设备","设备申请数不合法，必须为大于0的数字","已存在审核中的设备ID申请",
		  "一次查询设备ID数量不能超过50","设备ID不合法","页面ID不合法","页面参数不合法","一次删除页面ID数量不能超过10",
		  "页面已应用在设备中，请先解除应用关系再删除","一次查询页面ID数量不能超过50","时间区间不合法","保存设备与页面的绑定关系参数错误",
		  "门店ID不合法","设备备注信息过长","设备申请参数不合法","查询起始值begin不合法"
		  };
	private Map<Integer, String> backcodemap;

	public WeiChatExcption(int code) {
		this.code = code;
		if(backcodemap == null){
			backcodemap = new HashMap<Integer, String>();
			for (int i = 0; i < backcode.length; i++)
				backcodemap.put(backcode[i], explain[i]);
		}
		excptionExplain();
	}
	/**
	 * 异常说明
	 */
	private void excptionExplain() {
		 String string = backcodemap.get(code);
			if(code==0)
				log.info(string);
			else
				log.error(string);
	}

	public static void main(String[] args) {
		WeiChatExcption excption = new WeiChatExcption(40163);
//		excption.excptionExplain();
//		System.out.println(backcode.length);
//		System.out.println(explain.length);
	}
	
	
}